In [264]:
import pandas as pd
import numpy as np

In [265]:
film = pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\film.csv')
actor= pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\actor.csv')
category= pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\category.csv')
inventory= pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\inventory.csv')
language= pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\language.csv')
old_HDD= pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\old_HDD.csv')
rental= pd.read_csv(r'C:\Users\diego\Documents\Mongo\w3-database-project\data\rental.csv')

In [266]:
lab=[film,actor,category,inventory,language,old_HDD,rental]

In [267]:
def rip(df):
    for i in df:
        if 'last_update' in i:
            i.drop(columns=['last_update'],inplace=True)
    
        if 'original_language_id' in i:
            i.drop(columns=['original_language_id'],inplace=True)
        pass
#En los DataFrame elimina las columnas con estos nombres

In [268]:
rip(lab)

In [269]:
def inventario(df):
    return df.groupby('film_id')['store_id'].value_counts().reset_index(name='qty')

In [270]:
inv_film= inventario(inventory)
inv_film.head(10)
#Del DataFrame inventory, con la funcion anterior te modifica la tabla que une las film_id por store_id y lo suma en qty

   film_id  store_id  qty
0        1         1    4
1        1         2    4
2        2         2    3
3        3         2    4
4        4         1    4
5        4         2    3
6        5         2    3
7        6         1    3
8        6         2    3
9        7         2    3

In [271]:
def fusionar(df, ncolumn, col1, col2):
     df[ncolumn] = df[[col1, col2]].apply(" ".join, axis =1)

#Funcion fusionar

In [272]:
fusionar(actor, "full_name", "first_name", "last_name")
#En esta unimos first_name con last_name

fusionar(old_HDD, "actor_id", "first_name", "last_name")
#EN una nueva columna actor_id y te une first_name con last_name

In [273]:
def add_code(key: pd.Series, value: pd.Series, repl: pd.DataFrame, column: str ):
    dictio = dict(zip(key, value))
    for i in dictio.keys():
        repl.replace({column : i}, dictio[i], inplace=True)
        
# Introduce un diccionario temporal con las keys y los values de series escogidas y sustituye, por esos values, los datos
#en un DataFrame que localiza a través de la key del diccionario

In [274]:
add_code(actor.full_name, actor.actor_id, old_HDD, "actor_id")

In [275]:
def drop_table(df,columna_borrar):
    try:
        df.drop(columns=columna_borrar, inplace=True)
    except:
        pass

In [276]:
col_del=['first_name','last_name','release_year']

drop_table(old_HDD,col_del)

#Eliminar las columnas de col_del mediante una funcion, porque si.

In [277]:
old_HDD

                     title  category_id  actor_id
0         ACADEMY DINOSAUR            6         1
1     ANACONDA CONFESSIONS            2         1
2              ANGELS LIFE           13         1
3    BULWORTH COMMANDMENTS           10         1
4            CHEAPER CLYDE           14         1
..                     ...          ...       ...
995      COMANCHEROS ENEMY            3        39
996        DAISY MENAGERIE           14        39
997        DESERT POSEIDON           11        39
998         EVERYONE CRAFT            9        39
999         EXORCIST STING           15        39

[1000 rows x 3 columns]

In [279]:
drop_table(actor,'full_name')

#Eliminamos esta columna al no tener mas valor

In [280]:
'''
Creamos una tabla llamada emp para especificar el id de los empleados y a que tiendan pertenecen. 
Añadiremos un tercer  empleado para que se vea la diferencia.
'''

emp = pd.DataFrame()

empleados = 1,2
tiendas = 1,2
country = 'Barcelona','Madrid'
names = 'Jorge','Diego'

emp['staff_id'] = empleados
emp['store_id'] = tiendas
emp['store'] = country
emp['name'] = names

emp

   staff_id  store_id      store   name
0         1         1  Barcelona  Jorge
1         2         2     Madrid  Diego

In [281]:
# Si queremos contratar a un nuevo empleado sería de la siguiente manera:
nueva_fila = { 'staff_id': 3, 'store_id': 1,'store': 'Barcelona','name':'Dani'} # creamos un diccionario
emp = emp.append(nueva_fila, ignore_index=True)

#Así quedaría:
emp

C:\Users\diego\AppData\Local\Temp\ipykernel_2816\1922176999.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  emp = emp.append(nueva_fila, ignore_index=True)

   staff_id  store_id      store   name
0         1         1  Barcelona  Jorge
1         2         2     Madrid  Diego
2         3         1  Barcelona   Dani

In [ ]:
'''
Hemos comprobado que la columna inventory_id no aporta ninguna información; no está relacionada con la tabla Inventory. 
Por lo tanto, decidimos eliminarla junto a la columna last_update. 
Pensamos que sería útil tener disposición de un film_id; lo añadimos. 
Preparamos la tabla para uso futuro de una forma que nos parece funcional."
'''

In [286]:
rental1 = rental.copy() #hacemos una copia que será la nueva tabla.

In [289]:
rental1.drop(index=list(range(len(rental1))), inplace=True) #limpiamos el nuevo data frame //ELiminamos filas
rental1['store_id'] =[] #Creamos una nueva columna
rental1

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, store_id]
Index: []